Revit 2018 API
UIApplication.MainWindowExtents Property
Get the rectangle that represents the screen pixel coordinates of Revit main window.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 18.0.0.0 (18.0.0.0)
Since: 2011
Syntax
C#
public virtual Rectangle MainWindowExtents { get; }
Visual Basic
Public Overridable ReadOnly Property MainWindowExtents As Rectangle
	Get
Visual C++
public:
virtual property Rectangle^ MainWindowExtents {
	Rectangle^ get ();
}
See Also
UIApplication Class
Autodesk.Revit.UI Namespace